In [2]:
import pandas as pd
import numpy as np
pd.__version__

'1.0.1'

In [3]:
df = pd.read_csv('./data/table.csv')
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [4]:
s = pd.Series(np.random.randn(5),index=['a','b','c','d','e'],name='这是一个Series',dtype='float64')

In [5]:
s.name

'这是一个Series'

In [6]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
s.dtype

dtype('float64')

In [8]:
s.mean

<bound method Series.mean of a   -1.177273
b   -0.481314
c   -0.971151
d   -0.836722
e    0.038144
Name: 这是一个Series, dtype: float64>

In [9]:
df = pd.DataFrame({'col1':list('abcde'),'col2':range(5,10),'col3':[1.3,2.5,3.6,4.6,5.8]},
                 index=list('一二三四五'))
df

  col1  col2  col3
一    a     5   1.3
二    b     6   2.5
三    c     7   3.6
四    d     8   4.6
五    e     9   5.8

In [10]:
df['col1']

一    a
二    b
三    c
四    d
五    e
Name: col1, dtype: object

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.rename(index={'一':'one'},columns={'col1':'new_col1'})

    new_col1  col2  col3
one        a     5   1.3
二          b     6   2.5
三          c     7   3.6
四          d     8   4.6
五          e     9   5.8

In [13]:
df.index

Index(['一', '二', '三', '四', '五'], dtype='object')

In [14]:
df.shape

(5, 3)

In [16]:
df.drop(index='五',columns='col1')

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6

In [17]:
df['col1']=[1,2,3,4,5]
del df['col1']

In [18]:
df

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

In [19]:
df1['B']=list('abc')
df1

NameError: name 'df1' is not defined

In [20]:
s = df.mean()

In [21]:
s

col2    7.00
col3    3.56
dtype: float64

In [22]:
s.to_frame

<bound method Series.to_frame of col2    7.00
col3    3.56
dtype: float64>

In [29]:
#练习1
df = pd.read_csv('data/Game_of_Thrones_Script.csv')
df.head()

,Release Date,Season,Episode,Episode Title,Name,Sentence
0,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,What do you expect? They're savages. One lot s...
1,2011/4/17,Season 1,Episode 1,Winter is Coming,will,I've never seen wildlings do a thing like this...
2,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,How close did you get?
3,2011/4/17,Season 1,Episode 1,Winter is Coming,will,Close as any man would.
4,2011/4/17,Season 1,Episode 1,Winter is Coming,gared,We should head back to the wall.

In [31]:
df['Name'].nunique()

564

In [34]:
df['Name'].value_counts().index[0]

'tyrion lannister'

In [38]:
df_word = df.assign(Words=df['Sentence'].apply(lambda x:len(x.split()))).sort_values(by='Name')
df_word.head()

,Release Date,Season,Episode,Episode Title,Name,Sentence,Words
276,2011/4/17,Season 1,Episode 1,Winter is Coming,a voice,"It's Maester Luwin, my lord.",5
3012,2011/6/19,Season 1,Episode 10,Fire and Blood,addam marbrand,ls it true about Stannis and Renly?,7
3017,2011/6/19,Season 1,Episode 10,Fire and Blood,addam marbrand,Kevan Lannister,2
13610,2014/6/8,Season 4,Episode 9,The Watchers on the Wall,aemon,And what is it that couldn't wait until mornin...,10
13614,2014/6/8,Season 4,Episode 9,The Watchers on the Wall,aemon,"Oh, no need. I know my way around this library...",48

In [45]:
L_count=[]
N_words=list(zip(df_word['Name'],df_word['Words']))
for i in N_words:
    if i==N_words[0]:
        L_count.append(i[1])
        last = i[0]
    else:
        import pdb; pdb.set_trace()
        L_count.append(L_count[-1]+i[1] if i[0]==last else i[1])
        last = i[0]
df_word['Count']=L_count
df_word['Name'][df_word['Count'].idxmax()]

> <ipython-input-45-27cb27dd45e8>(9)<module>()
-> L_count.append(L_count[-1]+i[1] if i[0]==last else i[1])
(Pdb) L_count
[5]
(Pdb) L_count[-1]+i[1]
12
(Pdb) exit

BdbQuit:

In [46]:
df = pd.read_csv('data/Kobe_data.csv',index_col='shot_id')
df.head()

,action_type,combined_shot_type,game_event_id,game_id,lat,loc_x,loc_y,lon,minutes_remaining,period,...,shot_made_flag,shot_type,shot_zone_area,shot_zone_basic,shot_zone_range,team_id,team_name,game_date,matchup,opponent
shot_id,,,,,,,,,,,,,,,,,,,,,
1,Jump Shot,Jump Shot,10,20000012,33.9723,167,72,-118.1028,10,1,...,NaN,2PT Field Goal,Right Side(R),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
2,Jump Shot,Jump Shot,12,20000012,34.0443,-157,0,-118.4268,10,1,...,0.0,2PT Field Goal,Left Side(L),Mid-Range,8-16 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
3,Jump Shot,Jump Shot,35,20000012,33.9093,-101,135,-118.3708,7,1,...,1.0,2PT Field Goal,Left Side Center(LC),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
4,Jump Shot,Jump Shot,43,20000012,33.8693,138,175,-118.1318,6,1,...,0.0,2PT Field Goal,Right Side Center(RC),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
5,Driving Dunk Shot,Dunk,155,20000012,34.0443,0,0,-118.2698,6,2,...,1.0,2PT Field Goal,Center(C),Restricted Area,Less Than 8 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR

In [50]:
pd.Series(list(zip(df['action_type'],df['combined_shot_type']))).value_counts().index[0]

('Jump Shot', 'Jump Shot')

In [51]:
pd.Series(list(list(zip(*(pd.Series(list(zip(df['game_id'],df['opponent'])))
                          .unique()).tolist()))[1])).value_counts().index[0]

'SAS'

In [52]:
#####第二章啦######
#loc中能传入的只有布尔列表和索引子集构成的列表
#iloc方法（注意与loc不同，切片右端点不包含
import numpy as np
import pandas as pd
df = pd.read_csv('data/table.csv',index_col='ID')
df.head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

In [53]:
df.iloc[3::4,7::-2].head()

     Physics  Weight   Address Class
ID
1104      B-      81  street_2   C_1
1203      A+      53  street_6   C_2
1302      A-      57  street_1   C_3
2101       C      84  street_7   C_1
2105       A      81  street_4   C_1

In [54]:
pd.interval_range(start=0,end=5)

IntervalIndex([(0, 1], (1, 2], (2, 3], (3, 4], (4, 5]],
              closed='right',
              dtype='interval[int64]')

In [55]:
math_interval = pd.cut(df['Math'],bins=[0,40,60,80,100])

In [56]:
math_interval.head()

ID
1101      (0, 40]
1102      (0, 40]
1103    (80, 100]
1104    (80, 100]
1105    (80, 100]
Name: Math, dtype: category
Categories (4, interval[int64]): [(0, 40] < (40, 60] < (60, 80] < (80, 100]]

In [57]:
df_i = df.join(math_interval,rsuffix='_interval')[['Math','Math_interval']].reset_index().set_index('Math_interval')

In [58]:
df_i.head()

                 ID  Math
Math_interval
(0, 40]        1101  34.0
(0, 40]        1102  32.5
(80, 100]      1103  87.2
(80, 100]      1104  80.4
(80, 100]      1105  84.8

In [59]:
df_i.loc[65].head()

                 ID  Math
Math_interval
(60, 80]       1202  63.5
(60, 80]       1205  68.4
(60, 80]       1305  61.7
(60, 80]       2104  72.2
(60, 80]       2202  68.5

In [62]:
df = pd.read_csv('data/UFO.csv')
df.rename(columns={'duration (seconds)':'duration'},inplace=True)
df.head()

           datetime     shape  duration   latitude   longitude
0  10/10/1949 20:30  cylinder    2700.0  29.883056  -97.941111
1  10/10/1949 21:00     light    7200.0  29.384210  -98.581082
2  10/10/1955 17:00    circle      20.0  53.200000   -2.916667
3  10/10/1956 21:00    circle      20.0  28.978333  -96.645833
4  10/10/1960 20:00     light     900.0  21.418056 -157.803611

In [63]:
df.query('duration>60')['shape'].value_counts().index[0]

'light'

In [64]:
bins_long = np.linspace(-180,180,13).tolist()
bins_la = np.linspace(-90,90,11).tolist()
cuts_long = pd.cut(df['longitude'],bins=bins_long)
df['cuts_long'] = cuts_long
cuts_la = pd.cut(df['latitude'],bins=bins_la)
df['cuts_la'] = cuts_la
df.head()

,datetime,shape,duration,latitude,longitude,cuts_long,cuts_la
0,10/10/1949 20:30,cylinder,2700.0,29.883056,-97.941111,"(-120.0, -90.0]","(18.0, 36.0]"
1,10/10/1949 21:00,light,7200.0,29.384210,-98.581082,"(-120.0, -90.0]","(18.0, 36.0]"
2,10/10/1955 17:00,circle,20.0,53.200000,-2.916667,"(-30.0, 0.0]","(36.0, 54.0]"
3,10/10/1956 21:00,circle,20.0,28.978333,-96.645833,"(-120.0, -90.0]","(18.0, 36.0]"
4,10/10/1960 20:00,light,900.0,21.418056,-157.803611,"(-180.0, -150.0]","(18.0, 36.0]"

In [65]:
df.set_index(['cuts_long','cuts_la']).index.value_counts().head()

((-90.0, -60.0], (36.0, 54.0])      27891
((-120.0, -90.0], (18.0, 36.0])     14280
((-120.0, -90.0], (36.0, 54.0])     11960
((-90.0, -60.0], (18.0, 36.0])       9923
((-150.0, -120.0], (36.0, 54.0])     9658
dtype: int64

In [66]:
df = pd.read_csv('data/Pokemon.csv')
df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [71]:
df['Type 2'].count()/df.shape[0]

0.5175

In [75]:
df.query('Total >= 580')['Legendary'].value_counts(normalize=True)

True     0.575221
False    0.424779
Name: Legendary, dtype: float64

In [76]:
df[df['Type 1']=='Fighting'].sort_values(by='Attack',ascending=False).iloc[:3]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
498,448,LucarioMega Lucario,Fighting,Steel,625,70,145,88,140,70,112,4,False
594,534,Conkeldurr,Fighting,NaN,505,105,140,95,55,65,45,5,False
74,68,Machamp,Fighting,NaN,505,90,130,80,65,85,55,1,False

In [81]:
df['range'] = df.iloc[:,5:11].max(axis=1)-df.iloc[:,5:11].min(axis=1)
atr = df[['Type 1','range']].set_index('Type 1')
max = 0
result = ''
for i in atr.index.unique():
    t = atr.loc[i,:].mean()
    if t.values[0]>max:
        max = t.values[0]
        result = i
result

'Steel'

In [82]:
attribute = df.query('Legendary == True')[['Type 1','Total']].set_index('Type 1')
max_value = 0
result = ''
for i in attribute.index.unique()[:-1]:
    temp = attribute.loc[i,:].mean()
    if temp[0] > max_value:
        max_value = temp[0]
        result = i
result

'Normal'

In [83]:
#####第三章
df = pd.read_csv('data/Diamonds.csv')
df.head()

   carat color  depth  price
0   0.23     E   61.5    326
1   0.21     E   59.8    326
2   0.23     E   56.9    327
3   0.29     I   62.4    334
4   0.31     J   63.3    335

In [89]:
df_r = df.query('carat>1')['price']
df_r.max()-df_r.min()

17561

In [95]:
bins = df['depth'].quantile(np.linspace(0,1,6)).tolist()
cut = pd.cut(df['depth'],bins = bins)
df['cuts'] = cut
color_result = df.groupby('cuts')['color'].describe()
color_result

              count unique top  freq
cuts
(43.0, 60.8]  11294      7   E  2259
(60.8, 61.6]  11831      7   G  2593
(61.6, 62.1]  10403      7   G  2247
(62.1, 62.7]  10137      7   G  2193
(62.7, 79.0]  10273      7   G  2000

In [96]:
df['均重价格']=df['price']/df['carat']
df.head()

   carat color  depth  price          cuts         均重价格
0   0.23     E   61.5    326  (60.8, 61.6]  1417.391304
1   0.21     E   59.8    326  (43.0, 60.8]  1552.380952
2   0.23     E   56.9    327  (43.0, 60.8]  1421.739130
3   0.29     I   62.4    334  (62.1, 62.7]  1151.724138
4   0.31     J   63.3    335  (62.7, 79.0]  1080.645161

In [97]:
color_result['top'] == [i[1] for i in df.groupby(['cuts'
                                ,'color'])['均重价格'].mean().groupby(['cuts']).idxmax().values]

cuts
(43.0, 60.8]    False
(60.8, 61.6]    False
(61.6, 62.1]    False
(62.1, 62.7]     True
(62.7, 79.0]     True
Name: top, dtype: bool

In [98]:
df = df.drop(columns='均重价格')

In [99]:
cuts = pd.cut(df['carat'],bins=[0,0.5,1,1.5,2,np.inf])
df['cuts'] = cuts
def f(nums):
    if not nums:        
        return 0
    res = 1                            
    cur_len = 1                        
    for i in range(1, len(nums)):      
        if nums[i-1] < nums[i]:        
            cur_len += 1                
            res = max(cur_len, res)     
        else:                       
            cur_len = 1                 
    return res

In [100]:
for name,group in df.groupby('cuts'):
    group = group.sort_values(by='depth')
    s = group['price']
    print(name,f(s.tolist()))

TypeError: 'numpy.float64' object is not callable

In [101]:
df = pd.read_csv('data/Drugs.csv')
df.head()

   YYYY State           COUNTY  SubstanceName  DrugReports
0  2010    VA         ACCOMACK   Propoxyphene            1
1  2010    OH            ADAMS       Morphine            9
2  2010    PA            ADAMS      Methadone            2
3  2010    VA  ALEXANDRIA CITY         Heroin            5
4  2010    PA        ALLEGHENY  Hydromorphone            5

In [103]:
idx=pd.IndexSlice
for i in range(2010,2018):
    print(i)
    county = (df.groupby(['COUNTY','YYYY']).sum().loc[idx[:,i],:].idxmax()[0][0])
    state = df.query('COUNTY == "%s"'%county)['State'].iloc[0]
    state_true = df.groupby(['State','YYYY']).sum().loc[idx[:,i],:].idxmax()[0][0]
    if state==state_true:
        print('在%d年，%s县的报告数最多，它所属的州%s也是报告数最多的'%(i,county,state))
    else:
        print('在%d年，%s县的报告数最多，但它所属的州%s不是报告数最多的，%s州报告数最多'%(i,county,state,state_true))

2010
在2010年，PHILADELPHIA县的报告数最多，它所属的州PA也是报告数最多的
2011
在2011年，PHILADELPHIA县的报告数最多，但它所属的州PA不是报告数最多的，OH州报告数最多
2012
在2012年，PHILADELPHIA县的报告数最多，但它所属的州PA不是报告数最多的，OH州报告数最多
2013
在2013年，PHILADELPHIA县的报告数最多，但它所属的州PA不是报告数最多的，OH州报告数最多
2014
在2014年，PHILADELPHIA县的报告数最多，但它所属的州PA不是报告数最多的，OH州报告数最多
2015
在2015年，PHILADELPHIA县的报告数最多，但它所属的州PA不是报告数最多的，OH州报告数最多
2016
在2016年，HAMILTON县的报告数最多，它所属的州OH也是报告数最多的
2017
在2017年，HAMILTON县的报告数最多，它所属的州OH也是报告数最多的

In [104]:
####第三章未完待续。。。。。

In [105]:
####开始第五章吧

In [106]:
df1 = pd.read_csv('data/Employee1.csv')
df2 = pd.read_csv('data/Employee2.csv')
df1.head()

  Company Name  Age  Height  Weight  Salary
0       A   a1   47     188    63.7   25819
1       A   a3   39     172    55.9   21983
2       A   a4   43     158    62.5   21755
3       A   a6   42     182    76.9   17354
4       A   a7   49     171    94.6    6177

In [107]:
L = list(set(df1['Name']).intersection(set(df2['Name'])))
L

['c12',
 'b3',
 'c13',
 'c3',
 'b7',
 'd10',
 'a1',
 'c10',
 'a3',
 'd5',
 'b15',
 'e11',
 'e8',
 'a6',
 'e10',
 'b1']

In [108]:
df_b1 = df1[~df1['Name'].isin(L)]
df_b2 = df2[~df2['Name'].isin(L)]
df_b = pd.concat([df1,df2]).set_index('Name')
df_b.head()

     Company  Age  Height  Weight  Salary
Name
a1         A   47     188    63.7   25819
a3         A   39     172    55.9   21983
a4         A   43     158    62.5   21755
a6         A   42     182    76.9   17354
a7         A   49     171    94.6    6177